---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetAnalyticalSurface
source: html/e086125f-1a53-8c75-267f-b0e62d83fa4e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetAnalyticalSurface Method

Gets the associative analytical parent surface element.

## Syntax (C#)
```csharp
public EnergyAnalysisSurface GetAnalyticalSurface()
```

## Returns
The associative analytical parent surface element.